#include <stdio.h>

typedef unsigned char BYTE;
typedef unsigned int UINT;

void IP(BYTE *in, BYTE *out);
void BtoW(BYTE *in, UINT *l, UINT *r);
void EP(UINT *r, BYTE *out);

BYTE ip[64] = {
    58, 50, 42, 34, 26, 18, 10, 2,
    60, 52, 44, 36, 28, 20, 12, 4,
    62, 54, 46, 38, 30, 22, 14, 6,
    64, 56, 48, 40, 32, 24, 16, 8,
    57, 49, 41, 33, 25, 17, 9, 1,
    59, 51, 43, 35, 27, 19, 11, 3,
    61, 53, 45, 37, 29, 21, 13, 5,
    63, 55, 47, 39, 31, 23, 15, 7};

BYTE E[48] = {
    32, 1, 2, 3, 4, 5,
    4, 5, 6, 7, 8, 9,
    8, 9, 10, 11, 12, 13,
    12, 13, 14, 15, 16, 17,
    16, 17, 18, 19, 20, 21,
    20, 21, 22, 23, 24, 25,
    24, 25, 26, 27, 28, 29,
    28, 29, 30, 31, 32, 1};

BYTE s_box[8][4][16] = {
    // S1
    {
        {14, 4, 13, 1, 2, 15, 11, 8, 3, 10, 6, 12, 5, 9, 0, 7},
        {0, 15, 7, 4, 14, 2, 13, 1, 10, 6, 12, 11, 9, 5, 3, 8},
        {4, 1, 14, 8, 13, 6, 2, 11, 15, 12, 9, 7, 3, 10, 5, 0},
        {15, 12, 8, 2, 4, 9, 1, 7, 5, 11, 3, 14, 10, 0, 6, 13}},
    // S2
    {
        {15, 1, 8, 14, 6, 11, 3, 4, 9, 7, 2, 13, 12, 0, 5, 10},
        {3, 13, 4, 7, 15, 2, 8, 14, 12, 0, 1, 10, 6, 9, 11, 5},
        {0, 14, 7, 11, 10, 4, 13, 1, 5, 8, 12, 6, 9, 3, 2, 15},
        {13, 8, 10, 1, 3, 15, 4, 2, 11, 6, 7, 12, 0, 5, 14, 9}},
    // S3
    {
        {10, 0, 9, 14, 6, 3, 15, 5, 1, 13, 12, 7, 11, 4, 2, 8},
        {13, 7, 0, 9, 3, 4, 6, 10, 2, 8, 5, 14, 12, 11, 15, 1},
        {13, 6, 4, 9, 8, 15, 3, 0, 11, 1, 2, 12, 5, 10, 14, 7},
        {1, 10, 13, 0, 6, 9, 8, 7, 4, 15, 14, 3, 11, 5, 2, 12}},
    // S4
    {
        {7, 13, 14, 3, 0, 6, 9, 10, 1, 2, 8, 5, 11, 12, 4, 15},
        {13, 8, 11, 5, 6, 15, 0, 3, 4, 7, 2, 12, 1, 10, 14, 9},
        {10, 6, 9, 0, 12, 11, 7, 13, 15, 1, 3, 14, 5, 2, 8, 4},
        {3, 15, 0, 6, 10, 1, 13, 8, 9, 4, 5, 11, 12, 7, 2, 14}},
    // S5
    {
        {2, 12, 4, 1, 7, 10, 11, 6, 8, 5, 3, 15, 13, 0, 14, 9},
        {14, 11, 2, 12, 4, 7, 13, 1, 5, 0, 15, 10, 3, 9, 8, 6},
        {4, 2, 1, 11, 10, 13, 7, 8, 15, 9, 12, 5, 6, 3, 0, 14},
        {11, 8, 12, 7, 1, 14, 2, 13, 6, 15, 0, 9, 10, 4, 5, 3}},
    // S6
    {
        {12, 1, 10, 15, 9, 2, 6, 8, 0, 13, 3, 4, 14, 7, 5, 11},
        {10, 15, 4, 2, 7, 12, 9, 5, 6, 1, 13, 14, 0, 11, 3, 8},
        {9, 14, 15, 5, 2, 8, 12, 3, 7, 0, 4, 10, 1, 13, 11, 6},
        {4, 3, 2, 12, 9, 5, 15, 10, 11, 14, 1, 7, 6, 0, 8, 13}},
    // S7
    {
        {4, 11, 2, 14, 15, 0, 8, 13, 3, 12, 9, 7, 5, 10, 6, 1},
        {13, 0, 11, 7, 4, 9, 1, 10, 14, 3, 5, 12, 2, 15, 8, 6},
        {1, 4, 11, 13, 12, 3, 7, 14, 10, 15, 6, 8, 0, 5, 9, 2},
        {6, 11, 13, 8, 1, 4, 10, 7, 9, 5, 0, 15, 14, 2, 3, 12}},
    // S8
    {
        {13, 2, 8, 4, 6, 15, 11, 1, 10, 9, 3, 14, 5, 0, 12, 7},
        {1, 15, 13, 8, 10, 3, 7, 4, 12, 5, 6, 11, 0, 14, 9, 2},
        {7, 11, 4, 1, 9, 12, 14, 2, 0, 6, 10, 13, 15, 3, 5, 8},
        {2, 1, 14, 7, 4, 10, 8, 13, 15, 12, 9, 0, 3, 5, 6, 11}}};

BYTE P[32] = {
    16, 7, 20, 21,
    29, 12, 28, 17,
    1, 15, 23, 26,
    5, 18, 31, 10,
    2, 8, 24, 14,
    32, 27, 3, 9,
    19, 13, 30, 6,
    22, 11, 4, 25};

BYTE PC_1[56] = {
    57, 49, 41, 33, 25, 17, 9,
    1, 58, 50, 42, 34, 26, 18,
    10, 2, 59, 51, 43, 35, 27,
    19, 11, 3, 60, 52, 44, 36,
    63, 55, 47, 39, 31, 23, 15,
    7, 62, 54, 46, 38, 30, 22,
    14, 6, 61, 53, 45, 37, 29,
    21, 13, 5, 28, 20, 12, 4};

int main()
{
    printf("미완성");
    return 0;
}

void IP(BYTE *in, BYTE *out)
{
    int i;
    BYTE whereByte, whereBit, mask = 0x80;
    for (i = 0; i < 64; i++)
    {
        whereByte = (ip[i] - 1) / 8;
        whereBit = (ip[i] - 1) % 8;

        if (in[whereByte] & (mask >> whereBit))
            out[i / 8] |= mask >> (i % 8);
    }
}

void BtoW(BYTE *in, UINT *l, UINT *r)
{
    int i;

    for (i = 0; i < 8; i++)
    {
        if (i < 4)
        {
            *l |= (UINT)in[i] << (24 - (i * 8));
        }
        else
        {
            *r |= (UINT)in[i] << (56 - (i * 8));
        }
    }
}

void EP(UINT *r, BYTE *out)
{
    int i;
    UINT mask = 0x80000000;

    for (i = 0; i < 48; i++)
    {
        if (*r & (mask >> (E[i] - 1)))
        {
            out[i / 8] |= (BYTE)(0x80 >> (i % 8));
        }
    }
}
// 48bit -> 32bit
UINT S_box_Transfer(BYTE *in)
{
    // temp변수에 48bit(8byte)를 6bit씩 넣는다
    BYTE mask = 0x80;
    UINT temp, out = 0;
    int column, row, shift = 28;

    for (int i = 0; i < 48; i++)
    {
        // in배열 요소 하나의 크기가 byte로 되어 있으니 각 byte마다 bit를 모두 반복으로 돌린다.
        if (in[i / 8] & (mask >> (i % 8)))
        {
            temp |= (0x20 >> (i % 6));
        }
        // 6bit로 추출한 temp를 가지고 s-box표로 값을 변환한다 6bit -> 4bit
        if ((i + 1) % 6 == 0)
        {
            // s-box의 column과 row를 구한다
            // row : 최상위, 최하단 비트의 합 2bit
            // column : row 비트를 제외한 나머지 4bit
            row = ((temp & 0x20) >> 4) + (temp & 0x01);
            column = (temp & 0x1E) >> 1;

            out += (UINT)(s_box[i / 6][row][column]) << shift;
            // s-box로 찾아낸 값을 out에 계속 대입 32bit
            temp = 0;
            shift -= 4;
        }
    }
    return out;
}
// s-box로 32bit만든 비트를 전치해주는 함수
UINT Permutation(UINT in)
{
    UINT out = 0;
    UINT mask = 0x80000000;
    for (int i = 0; i < 32; i++)
    {
        if (in & (mask >> P[i] - 1))
        {
            out |= (mask >> i);
        }
    }
    return out;
}

UINT f(UINT r, BYTE *rkey)
{
    BYTE data[6] = {
        0,
    };
    UINT out;

    EP(r, data);

    for (int i = 0; i < 6; i++)
    {
        data[i] = data[i] ^ rkey[i];
    }

    out = Permutation(S_box_Transfer(data));
}
// key 64bit -> 56bit
void PC1(BYTE *in, BYTE *out)
{
    int whereByte, whereBit;
    BYTE mask = 0x80;

    for (int i = 0; i < 56; i++)
    {
        // 최대 6이 나와야함으로 마이너스 1을 해줌
        whereByte = (PC_1[i] - 1) / 8;
        whereBit = (PC_1[i] - 1) % 8;

        if (in[whereByte] & (mask >> whereBit))
        {
            out[i / 8] |= (mask >> (i % 8));
        }
    }
}

void makeBit28(UINT *c, UINT *d, BYTE *data)
{
    BYTE mask = 0x80;
    for (int i = 0; i < 56; i++)
    {
        if (i < 28)
        {
            if (data[i / 8] & (mask % i))
            {
                *c |= 0x08000000 >> i;
            }
        }
        else
        {
            if (data[i / 8] & (mask >> (i % 8)))
            {
                *d |= (0x08000000 >> (i - 28));
            }
        }
    }
}

UINT cir_shift(UINT n, int r)
{
    int shifts[16] = {1, 1, 2, 2, 2, 2, 2, 2, 1, 1, 2, 2, 2, 2, 2, 1};

    for (int i = 0; i < 16; i++)
    {
        if (shifts[i] == 1)
        {
            n = ((n << 1) + (n >> 27)) & 0x0FFFFFFF;
        }
        else
        {
            n = ((n << 2) + (n >> 26)) & 0x0FFFFFFF;
        }
    }
    return n;
}